STOP_KEYWORDS = [
    "выгодное предложение",
    "интересно? - пиши"
    "каждый день на пассиве",
    "обращайтесь в личные сообщения",
    "появилась необходимость в серьёзных партнёрах",
    "ищем людей",
    "для онлайн сотрудничества",
    "часов в день",
    "возраст oт 18",
    "дополнительный доход",
    "переходи в бота и получи подарок",
    "в день твoегo времени",
    "онлайн доход",
    "ждать вас в личных сообщениях",
    "хочу обратиться к будущим партнерам",
    "достойный доход",
    "доход от",
    "доход до",
    "все законно",
    "баксов в день",
    "без опыта и вложений",
    "ищем сотрудников",
    "с доходом от",
    "научу поднимать",
    "жду в личке",
    "жду в лс",
    "пиши +",
    "пишите +",
    "пишите в лс",
    "пиши в лс",
    "писать в лс",
    "подробности в лс",
    "только для совершеннолетних",
    "нужны ответственные люди",
    "для удалённого заработка",
    "для удалённой работы",
    "можно совмещать с основной работой",
    *[f"легально {n}+" for n in range(14, 26)],
    *[f"возраст от {n}+" for n in range(14, 26)],
    *[f"возраст {n}+" for n in range(14, 26)],
]

NORMALIZE_KEYWORD: dict[str, str] = {
    # latin to kiril
    "a": "а",
    "b": "б",
    "c": "с",
    "d": "д",
    "e": "е",
    "f": "ф",
    "g": "г",
    "h": "х",
    "i": "и",
    "j": "й",
    "k": "к",
    "l": "л",
    "m": "м",
    "n": "н",
    "o": "о",
    "p": "п",
    "q": "қ",
    "r": "р",
    "s": "с",
    "t": "т",
    "u": "у",
    "v": "в",
    "w": "щ",
    "x": "кс",
    "y": "ы",
    "z": "з",

    # numerics
    "0": "о",

    # others
    "ё": "е",

    "@": "а",
    "°": "о",
    "а": "о",
    "у": "и",

    "3": "э",
    "€": "э",

    "4": "ч",
    "№": "и",
    "$": "с",
    "₽": "р",

    # Synonims
    # ЛС
    "личк": "лс",
    "личных": "лс",

    # Доход
    "зороботок": "доход",
    "заработком": "доходом"
}


if __name__ == "__main__":
    # print(*STOP_KEYWORDS, sep="\n\n")
    for k, v in NORMALIZE_KEYWORD.items():
        print(k, "->", v)
        print()
